/*
変数 1 --------------------------------------------------------------------------------------------
*/

let nickname = "にんじゃわんこ";

console.log(nickname); // にんじゃわんこ

/*
変数 2 --------------------------------------------------------------------------------------------
*/

let length = 5;

console.log(length); // 5

console.log(length * length * 3 ); // 75

/*
変数の更新 --------------------------------------------------------------------------------------------
*/

let real_name = "にんじゃわんこ";
console.log(real_name); // にんじゃわんこ

real_name = "とりずきん";

console.log(real_name); // とりずきん

/*
変数の更新 数字
*/

let number = 7;
console.log(number); // 7

number += 3;

console.log(number); // 10

number /= 2;

console.log(number); // 5

/*
定数  --------------------------------------------------------------------------------------------
*/

const language = "フランス語";

console.log(language); // フランス語

console.log(language + "を話せます"); // フランス語を話せます

/*
テンプレートリテラル --------------------------------------------------------------------------------------------
*/

const surname = "にんじゃわんこ";
const years = 14;

console.log(`ぼくの名前は${surname}です`); // ぼくの名前はにんじゃわんこです

console.log(`今は${years}歳です`); // 今は14歳です

/*
条件文 if--------------------------------------------
*/

const level = 12;

// 条件式を「level > 10」とするif文を作ってください
if (level > 10) {
  console.log("レベルが10より大きいです");
}


/*
条件文 && --------------------------------------------------------------------------------------------
*/

const age = 24;

//定数ageの値が20以上かつ30未満」という条件のif文を作成してください。また、その中で文字列「私は20代です。」というメッセージを出力してください。

if (age >= 20 && age < 30) {
    console.log('私は20代です。');
}
